// //Створіть простий "замітки" додаток. У додатку повинно бути поле вводу тексту, 
// кнопка "Додати" та список, де будуть відображатися всі додані замітки.

// Завдання:

// Створіть HTML-розмітку з полем вводу, кнопкою та списком.
// Зробіть так, щоб при кліку на кнопку "Додати" текст з поле вводу додавався до списку.
// Зберігайте замітки у локальному сховищі (localStorage), щоб вони зберігалися після перезавантаження сторінки.
// При завантаженні сторінки перевіряйте, чи є збережені замітки у локальному сховищі і відображайте їх у списку.
// Зробіть так, щоб замітки можна було видаляти зі списку за допомогою кліку на них.
// Опрацюйте можливі ситуації, коли поле вводу порожнє або користувач спробує додати вже існуючу замітку.

